app/views/users/index.html.erb


<h2><%= User.count %> users</h2>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"