app/views/carts/show.html.erb

      <div class="row">
        <% @cart.line_items.order(:id).each do |line_item| %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]

            <div class="card-body">
              <h5 class="mb-4">Cart (<span><%= pluralize @cart.line_items.count, "item" %></span>)</h5>
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 33]]