app/views/foods/_form.html.erb

    <label>Category:</label>
    <%= f.select :category_id, Category.pluck(:title, :id), :include_blank => true, :class => "form-control" %>
---
SELECT "categories"."title", "categories"."id" FROM "categories"