app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def fetch_user
    @current_user = User.find_by :id => session[:user_id] if session[:user_id].present?
    session[:user_id] = nil unless @current_user.present?

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-10-26 07:37:53.726869"], ["updated_at", "2021-10-26 07:37:53.726869"]]
---
  def current_cart
    # if session[:cart_id]
    #   cart = Cart.find_by :id => session[:cart_id]
    #   if cart.present?
    #     @current_cart = cart
    #   else
    #     session[:cart_id] = nil
    #   end
    # end

    @current_cart = Cart.find_by :id => session[:cart_id] if session[:cart_id].present?
    session[:cart_id] = nil unless @current_cart.present?

    if session[:cart_id] == nil
      @current_cart = Cart.create