app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def show
    @food = Food.find params[:id]

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def edit
    @food = Food.find params[:id]

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "foods" SET "category_id" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["category_id", 6], ["updated_at", "2021-10-25 13:20:47.671893"], ["id", 41]]
---
  def update
    food = Food.find params[:id]
    food.update food_params