app/controllers/line_items_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 128], ["LIMIT", 1]]
SELECT  1 AS one FROM "foods" INNER JOIN "line_items" ON "foods"."id" = "line_items"."food_id" WHERE "line_items"."cart_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["cart_id", 1], ["id", 128], ["LIMIT", 1]]
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."food_id" = $2 LIMIT $3  [["cart_id", 1], ["food_id", 128], ["LIMIT", 1]]
INSERT INTO "line_items" ("food_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["food_id", 128], ["cart_id", 1], ["created_at", "2021-10-26 07:04:51.704997"], ["updated_at", "2021-10-26 07:04:51.704997"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2021-10-26 07:18:59.701613"], ["id", 1]]
---
  def create
    chosen_food = Food.find(params[:food_id])
    current_cart = @current_cart


    if current_cart.foods.include?(chosen_food)
      @line_item = current_cart.line_items.find_by(:food_id => chosen_food)
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.food = chosen_food
    end

    @line_item.save

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2021-10-26 07:24:53.026834"], ["id", 1]]
---
  def add_quantity
    @line_item = LineItem.find(params[:id])
    @line_item.quantity += 1
    @line_item.save

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2021-10-26 07:24:50.950789"], ["id", 1]]
---
  def reduce_quantity
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 0
      @line_item.quantity -= 1
    end
    @line_item.save

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 5]]
---
  def destroy
    line_item = LineItem.find params[:id]
    line_item.destroy