app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all # if Order.find params[:user_id] == @current_user.id

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 33]]
INSERT INTO "orders" ("name", "email", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Keith"], ["email", "keith.d.hau@gmail.com"], ["address", "Unit 101, 209 Harris ST"], ["created_at", "2021-10-26 09:47:44.159096"], ["updated_at", "2021-10-26 09:47:44.159096"]]
UPDATE "line_items" SET "cart_id" = $1, "order_id" = $2, "updated_at" = $3 WHERE "line_items"."id" = $4  [["cart_id", nil], ["order_id", 15], ["updated_at", "2021-10-27 05:35:42.993985"], ["id", 39]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 33]]
---
  def create
    @order = Order.new order_params
    @current_cart.line_items.each do |item|
      @order.line_items << item
      item.update(cart_id: nil)
    end
    @order.save
    Cart.destroy(session[:cart_id])