app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "11@1"], ["created_at", "2021-10-26 08:43:27.502775"], ["updated_at", "2021-10-26 08:43:27.502775"], ["password_digest", "$2a$12$iFL85HhGtGo7A6sondC0IuOFjhHTysScKXXd8iFXTT9BRXtKaZ39m"]]

  def update
    user = User.find params[:id]
    user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "123"], ["updated_at", "2021-10-26 09:43:21.022037"], ["id", 17]]