app/views/categories/show.html.erb


  <% @category.foods.each do |food| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."category_id" = $1  [["category_id", 6]]